[
    {
      "title": "Student Internship Empowers Women Leaders in Technology",
      "image_src": "https://www.trincoll.edu/wp-content/uploads/2024/04/Technology-and-Leadership-Interns-2024-10-scaled-e1713211257786-726x1024.jpg",
      "text": "Now in its fifth year, the Trinity Technology and Leadership Internship for Women empowers students by providing them with skills in technology and offering leadership experiences. This initiative was jointly devised by Ewa Syta, associate professor of computer science and faculty lead for Trinity’s Center for Entrepreneurship, and Trinity’s Library and Information Technology Services (LITS) leadership. Syta said, “The internship leverages Trinity’s resources, as well as the remarkable commitment of our staff and faculty, to help increase the participation of women in technology, particularly at the executive levels. Mia Creane ’25, Vy Sa Nguyen ’26, and Hanna Saffi ’26 are the students participating in this internship program for the spring 2024 semester. In addition to receiving mentoring from Syta, the interns work closely with the LITS team to develop their skills and build connections through networking."
    },
    {
      "title": "Trinity Faculty Member Receives Fulbright to Conduct Research in Poland",
      "image_src": "https://www.trincoll.edu/wp-content/uploads/2024/03/Women-In-Cybersecurity-2024-selects-02-1-1536x1022.jpg",
      "text": "Trinity College Associate Professor of Computer Science Ewa Syta has received a prestigious Fulbright U.S. Scholar award for 2024-25 to conduct research in her native country of Poland. The Fulbright Program—led by the United States government in partnership with more than 160 countries worldwide—offers international educational and cultural exchange programs for passionate and accomplished students, scholars, artists, teachers, and professionals of all backgrounds to study, teach, or pursue important research and professional projects. In collaboration with researchers at Poland’s National Research Institute (NASK) under the supervision of the Ministry of Digital Affairs, Syta plans to develop a long-term strategy for the implementation of a digital identity wallet for Poland. “This is a critical component of the EU’s initiative to create a universal digital identity ecosystem, where electronic transactions can have the same legal validity as traditional paper-based transactions,"
    },
    {
      "title": "Trinity Students Combine Tech Skills with Design Thinking in 3D Printing Workshop",
      "image_src": "https://www.trincoll.edu/wp-content/uploads/2024/03/P1004549-edit-1536x1037.jpg",
      "text": "For the course’s midterm assignment, students were asked to develop a 3D prototype of either a cell phone stand or a pen holder using SketchUp software and 3D printers. To teach the students more about the intricacies of 3D printing, David Tatem, head of Digital Learning and Scholarship at Trinity, held an interactive workshop for the class, providing step-by-step instructions on how to operate the software. By the end of the workshop, the students were able to create 3D models of a keychain, personalized with an engraving of their names."
    }
  ]
  